###############################################################################
# Zadatak 2: Setup
###############################################################################
source scripts/startup.tcl
read_verilog ../yosys/out/pfe_logic_yosys.v
link_design pfe_chip


###############################################################################
utl::report "Read constraints"
read_sdc src/constraints_logic.sdc

utl::report "Check constraints"
check_setup -verbose                                      > ${report_dir}/01-01_${proj_name}_checks.rpt
report_checks -unconstrained -format end -no_line_splits >> ${report_dir}/01-01_${proj_name}_checks.rpt
report_checks -format end -no_line_splits                >> ${report_dir}/01-01_${proj_name}_checks.rpt
report_checks -format end -no_line_splits                >> ${report_dir}/01-01_${proj_name}_checks.rpt
utl::report "Connect global nets (power)"
source scripts/power_connect.tcl

###############################################################################
# Zadatak 3: Inicijalizacija floorplan-a
###############################################################################

set chipH    1600; # OR die height (top to bottom)
set chipW    1600; # OR die width (left to right)
set padD      180; # pad depth (edge to core)
set padW       80; # pad width (beachfront)
set padBond    70; # bonding pad size
set powerRing  80; # reserved space for power ring

# starting from the outside and working towards the core area on each side
set coreMargin [expr {$padD + $padBond + $powerRing}];

utl::report "Initialize Chip"
# coordinates are lower-left x and y, upper-right x and y
initialize_floorplan -die_area "0 0 $chipW $chipH" \
                     -core_area "$coreMargin $coreMargin [expr $chipW-$coreMargin] [expr $chipH-$coreMargin]" \
                     -site "CoreSite"


###############################################################################
# Zadatak 6: Postavljanje I/O pinova, prvo modifikujte src/pfe_padring.tcl
###############################################################################
source src/pfe_padring.tcl


##########################################################################
# Chip and Core Area
##########################################################################
# core gets snapped to site-grid -> get real values
set coreArea      [ord::get_core_area]
set core_leftX    [lindex $coreArea 0]
set core_bottomY  [lindex $coreArea 1]
set core_rightX   [lindex $coreArea 2]
set core_topY     [lindex $coreArea 3]


##########################################################################
# Tracks 
##########################################################################
# We need to define the metal tracks 
# (where the wires on each metal should go)
make_tracks

# the height of a standard cell, useful to align things
set siteHeight [ord::dbu_to_microns [[dpl::get_row_site] getHeight]]

###############################################################################
# Zadatak 8: Napajanje
###############################################################################
source scripts/power_grid.tcl

###############################################################################
# Kraj zadatka 8: Napajanje
###############################################################################
# Save checkpoint
save_checkpoint 01_${proj_name}.floorplan
report_image "01_${proj_name}.floorplan" true

utl::report "###############################################################################"
utl::report "# Stage 01 complete: Checkpoint saved to ${save_dir}/01_${proj_name}.floorplan.zip"
utl::report "###############################################################################"

